//
// Created by 谷岩 on 2022/12/22.
//
#include "stdio.h"
#include "menu.h"

//选择函数 相当于输入做了封装 方便option函数使用
int select(){
    int option= -1;
    fflush(stdout);
    scanf("%d",&option);
    return option;
}

//主菜单
int main_menu(){
    printf("********************************************************************************************\n");
    printf("欢迎进入迷你图书字管理系统V1.0，请选择：\n");
    printf("1---分类管理\n");
    printf("2---新书入库\n");
    printf("3---旧书出库\n");
    printf("4---书籍查询\n");
    printf("5---书籍借阅\n");
    printf("6---书籍归还\n");
    printf("7---退出系统\n");
    printf("********************************************************************************************\n");
    printf("输入1-7来选择系统要执行的功能>");
    return select();
}

//分类管理菜单
int catagory_menu(){
    printf("********************************************************************************************\n");
    printf("1---查询分类信息\n");
    printf("2---增加分类信息\n");
    printf("3---删除分类信息\n");
    printf("4---修改分类信息\n");
    printf("5---返回主界面\n");
    printf("********************************************************************************************\n");
    printf("通过输入1-5来选择执行相应的功能>");
    return select();
}

//入库菜单
void add_book_menu(){
    printf("********************************************************************************************\n");
    printf("请依次按输入如下新书信息并回车确认（各信息间以空格分隔）：\n");
    printf("分类号 书号 书名 书籍数量\n");
    printf("********************************************************************************************\n");
    fflush(stdout);
}

//出库菜单
void delete_book_menu(){
    printf("********************************************************************************************\n");
    printf("请依次按输入如下书籍信息并回车确认（各信息间以空格分隔）：\n");
    printf("分类号 书号\n");
    printf("********************************************************************************************\n");
    fflush(stdout);
}